target="""
用户id:385---接听率:0.2466---礼物获得率:0.743009---视频平均时长:1534.1852---接听次数:40554---挂断率:0.1571---颜值:0---
用户id:414---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:65---
用户id:423---接听率:0.5455---礼物获得率:0.626732---视频平均时长:54.4352---接听次数:81108---挂断率:0.1571---颜值:0---
用户id:424---接听率:0.2088---礼物获得率:5.919776---视频平均时长:28.8421---接听次数:14269---挂断率:0.1571---颜值:82---
用户id:429---接听率:0.3743---礼物获得率:0.543625---视频平均时长:62.6643---接听次数:105140---挂断率:0.1571---颜值:75---
用户id:456---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:50---
用户id:458---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:80---
用户id:563---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:98---
用户id:576---接听率:0.2000---礼物获得率:---视频平均时长:269.0000---接听次数:751---挂断率:0.1571---颜值:65---
用户id:598---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:100---
用户id:712---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:100---
用户id:727---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:0---
用户id:728---接听率:0.0588---礼物获得率:1.970706---视频平均时长:144.5000---接听次数:1502---挂断率:0.1571---颜值:0---
用户id:1539---接听率:0.3536---礼物获得率:0.750054---视频平均时长:83.0753---接听次数:69843---挂断率:0.1571---颜值:82---
用户id:1577---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:0---
用户id:1594---接听率:0.0741---礼物获得率:33.759361---视频平均时长:36.5000---接听次数:1502---挂断率:0.1571---颜值:0---
用户id:1600---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:0---
用户id:1603---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:0---
用户id:1646---接听率:0.0769---礼物获得率:21.293387---视频平均时长:30.6667---接听次数:2253---挂断率:0.1571---颜值:51---
用户id:1661---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:0---
用户id:1667---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:0---
用户id:1696---接听率:0.1067---礼物获得率:0.059920---视频平均时长:18.8750---接听次数:6008---挂断率:0.1571---颜值:0---
用户id:1700---接听率:0.1667---礼物获得率:0.639148---视频平均时长:20.0000---接听次数:1502---挂断率:0.1571---颜值:80---
用户id:1706---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:0---
用户id:1708---接听率:0.3600---礼物获得率:0.046235---视频平均时长:150.6667---接听次数:13518---挂断率:0.1571---颜值:0---
用户id:2211---接听率:0.1667---礼物获得率:---视频平均时长:0.0000---接听次数:751---挂断率:0.1571---颜值:0---
用户id:2212---接听率:0.3929---礼物获得率:1.024089---视频平均时长:114.3636---接听次数:24783---挂断率:0.1571---颜值:0---
用户id:2228---接听率:0.0000---礼物获得率:0---视频平均时长:0---接听次数:0---挂断率:0---颜值:0---
用户id:2235---接听率:0.5714---礼物获得率:---视频平均时长:103.8750---接听次数:6008---挂断率:0.1571---颜值:0---
用户id:2240---接听率:0.1165---礼物获得率:---视频平均时长:67.9167---接听次数:9012---挂断率:0.1571---颜值:0---
用户id:2244---接听率:0.3889---礼物获得率:4.280008---视频平均时长:37.7143---接听次数:5257---挂断率:0.1571---颜值:0---
用户id:2245---接听率:0.2222---礼物获得率:0.026631---视频平均时长:48.4167---接听次数:9012---挂断率:0.1571---颜值:0---
"""

new_str=target.split('---')
new_dict={}
receive_rate_list=[]
get_gift_rate=[]
video_average=[]
accept_call=[]
refuse_times=[]
face_score=[]
for i in new_str:
    if i!='\n':
        key,value=i.split(':')

        if key=='接听率':
            receive_rate_list.append(value)
        elif key=='礼物获得率':
            get_gift_rate.append(value)
        elif key=='视频平均时长':
            video_average.append(float(value))
        elif key=='接听次数':
            accept_call.append(value)
        elif key=='挂断率':
            refuse_times.append(value)
        elif key=='颜值':
            face_score.append(int(value))

receive_rate_list=sorted(receive_rate_list,reverse=True)
get_gift_rate=sorted(get_gift_rate,reverse=True)
video_average=sorted(video_average,reverse=True)
accept_call=sorted(accept_call,reverse=True)
refuse_times=sorted(refuse_times,reverse=True)
face_score=sorted(face_score,reverse=True)

for i in receive_rate_list:
    print(i,end=' ')

for i in get_gift_rate:
    print(i,end=' ')

print('平均时长:')
for i in video_average:
    print(i,end=' ')
print()
for i in accept_call:
    print(i,end=' ')
print()
for i in refuse_times:
    print(i,end=' ')
print()
for i in face_score:
    print(i,end=' ')
print()
